Website/app/views/user/messages.html.erb

				<td><%= link_to message.title, user_show_message_path(message) %></td>
				<td><%= format_time(message.created_at) %></td>
				<td><%= (message.read==true)?format_time(message.updated_at):("未读") %></td>
---
INSERT INTO "messages" ("from_user_id", "body", "receive_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["from_user_id", 1], ["body", "Hello"], ["receive_user_id", 2], ["created_at", "2015-01-01 07:39:23.589491"], ["updated_at", "2015-01-01 07:39:23.589491"]]
UPDATE "messages" SET "read" = 't', "updated_at" = '2015-01-01 07:54:31.859023' WHERE "messages"."id" IN (SELECT "messages"."id" FROM "messages" WHERE (from_user_id=1 or receive_user_id=1) AND "messages"."read" = 'f' AND "messages"."receive_user_id" = 1  ORDER BY id DESC LIMIT 10)