Website/app/controllers/course_controller.rb

SELECT  "courses".* FROM "courses"  ORDER BY "courses"."id" ASC LIMIT 1 OFFSET 1
---
	def list
		@courses = Course.list.paginate(:page=>params[:page])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "current_course_id" = 2 WHERE "users"."id" = ?  [["id", 1]]
---
	def choose
		if @current_user.courses.where(:id=>params[:course_id]).exists? == false
			flash[:error] = "你没有报名这们课程或者你的申请还没有通过"
		else
			@current_user.update_column(:current_course_id,params[:course_id])

SELECT  "courses".* FROM "courses"  ORDER BY "courses"."id" ASC LIMIT 1 OFFSET 1
---
	def my_list
		@courses = @current_user.courses.list.paginate(:page=>params[:page])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "user_course_ships".* FROM "user_course_ships" WHERE "user_course_ships"."course_id" = ? AND "user_course_ships"."user_id" IS NULL  ORDER BY "user_course_ships"."id" ASC LIMIT 1  [["course_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@course = Course.find(params[:course_id])
		@user_course_ship = @course.user_course_ships.where(:user=>@current_user).first

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "user_course_ships".* FROM "user_course_ships" WHERE "user_course_ships"."course_id" = ? AND "user_course_ships"."course_id" = 1  ORDER BY "user_course_ships"."id" ASC LIMIT 1  [["course_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "courses".* FROM "courses"  ORDER BY "courses"."id" ASC LIMIT 1 OFFSET 1
---
	def user_list
		@course = Course.find(params[:course_id])
		@user_course_ship = @course.user_course_ships.where(:user=>@current_user).first
		if @current_user.level < User::LevelWatcher && (@user_course_ship == nil || @user_course_ship.status != UserCourseShip::StatusPassed)
			flash[:error] = "你没有权限查看本页面"
			return redirect_to :back
		end
		@user_course_ships = @course.valid_user_course_ships.list.paginate(:page=>params[:page])