Website/app/controllers/problem_controller.rb

	def list
		@course_problem_ships = @current_user.current_course.course_problem_ships.list.paginate(:page=>params[:page])
---
SELECT  "course_problem_ships".* FROM "course_problem_ships" WHERE "course_problem_ships"."course_id" = ? LIMIT 10 OFFSET 0  [["course_id", 2]]
SELECT  "courses".* FROM "courses"  ORDER BY "courses"."id" ASC LIMIT 1 OFFSET 1

	def show
		@course = Course.find(params[:course_id])
		@user_course_ship = @course.user_course_ships.where(:user=>@current_user).first
		if @user_course_ship == nil || @user_course_ship.status != UserCourseShip::StatusPassed
			flash[:error] = "你不能查看本题目"
		end
		@course_problem_ship = @course.course_problem_ships.find(params[:problem_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "user_course_ships".* FROM "user_course_ships" WHERE "user_course_ships"."course_id" = ? AND "user_course_ships"."user_id" = 1  ORDER BY "user_course_ships"."id" ASC LIMIT 1  [["course_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "course_problem_ships".* FROM "course_problem_ships" WHERE "course_problem_ships"."course_id" = ? AND "course_problem_ships"."id" = NULL LIMIT 1  [["course_id", 1]]
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", 1]]