Website/app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["username", "sddds"]]
INSERT INTO "entries" ("ip", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ip", "127.0.0.1"], ["user_id", 1], ["created_at", "2014-12-31 12:39:28.759375"], ["updated_at", "2014-12-31 12:39:28.759375"]]
---
	def login_post
		@user = User.where(:username=>params[:user][:username]).first
		if @user == nil
			flash[:error] = "用户#{params[:user][:username]}不存在"
			return redirect_to user_login_path
		end
		if @user.password != params[:user][:password]
			flash[:error] = "用户名或密码错误"
			return redirect_to user_login_path
		end
		session[:current_user_id] = @user.id
		flash[:success] = "登录成功"
		@user.entries.create!(:ip=>request.remote_ip)

INSERT INTO "users" ("username", "password", "realname", "email", "school", "create_ip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "entries" ("ip", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ip", "127.0.0.1"], ["user_id", 2], ["created_at", "2014-12-31 16:30:21.847727"], ["updated_at", "2014-12-31 16:30:21.847727"]]
---
	def register_post
		@user = User.new(params[:user].permit(:username,:password,:password_confirmation,:realname,:email,:school))
		@user.create_ip = request.remote_ip
		if @user.save
			session[:current_user_id] = @user.id
			@user.entries.create!(:ip=>request.remote_ip)

UPDATE "users" SET "realname" = ?, "email" = ?, "school" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["realname", "管理员"], ["email", ""], ["school", ""], ["updated_at", "2014-12-31 17:26:25.927036"], ["id", 1]]
---
	def modify_post
		if @current_user.password != params[:current_password]
			flash[:error] = "密码错误"
		else
			if params[:user][:password] == nil || params[:user][:password] == ""
				params[:user][:password] = @current_user.password
				params[:user][:password_confirmation] = @current_user.password
			end
			if @current_user.update(params[:user].permit(:password,:password_confirmation,:realname,:email,:school)) == false

SELECT  "messages".* FROM "messages" WHERE (from_user_id=1 or receive_user_id=1)  ORDER BY id DESC LIMIT 30 OFFSET 0
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)
SELECT COUNT(*) FROM "messages" WHERE (from_user_id=1 or receive_user_id=1)
UPDATE "messages" SET "read" = 't', "updated_at" = '2015-01-01 07:54:31.859023' WHERE "messages"."id" IN (SELECT "messages"."id" FROM "messages" WHERE (from_user_id=1 or receive_user_id=1) AND "messages"."read" = 'f' AND "messages"."receive_user_id" = 1  ORDER BY id DESC LIMIT 10)
---
	def messages
		@messages = @current_user.all_messages.paginate(:page => params[:page]).includes(:from_user,:receive_user)
		@messages.notread.where(:receive_user=>@current_user).update_all(:read=>true, :updated_at=>Time.now)

SELECT  "messages".* FROM "messages" WHERE (from_user_id=1 or receive_user_id=1)  ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT  "users".* FROM "users" WHERE "users"."username" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["username", "root"]]
INSERT INTO "messages" ("title", "body", "from_user_id", "receive_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "测试"], ["body", "测试测试"], ["from_user_id", 1], ["receive_user_id", 2], ["created_at", "2015-01-01 08:43:05.282545"], ["updated_at", "2015-01-01 08:43:05.282545"]]
---
	def messages_post
		@send_message = Message.new(params[:message].permit(:title,:body))
		@send_message.from_user = @current_user
		receive_user = User.where(:username=>params[:message][:receive_user]).first
		if receive_user == nil
			@send_message.errors[:receive_user] << "收信人不存在"

SELECT  "messages".* FROM "messages" WHERE (from_user_id=1 or receive_user_id=1) AND "messages"."id" = ?  ORDER BY id DESC LIMIT 1  [["id", 1]]
---
	def show_message
		@message = @current_user.all_messages.find(params[:message_id])

SELECT  "entries".* FROM "entries" WHERE "entries"."user_id" = ?  ORDER BY id DESC LIMIT 10 OFFSET 0  [["user_id", 1]]
---
	def entries
		@entries = @current_user.entries.paginate(:page => params[:page], :per_page => 10)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@user = User.find(params[:user_id])