Website/app/views/layouts/_navigation.html.erb

							<li class="divider"></li>
							<% if @current_user.courses.size <= 10 %>
---
SELECT  "courses".* FROM "courses"  ORDER BY "courses"."id" ASC LIMIT 1 OFFSET 1