Website/app/views/course/show.html.erb

SELECT  "user_course_ships".* FROM "user_course_ships" WHERE "user_course_ships"."course_id" = ? AND "user_course_ships"."user_id" IS NULL  ORDER BY "user_course_ships"."id" ASC LIMIT 1  [["course_id", 2]]
SELECT COUNT(*) FROM "users" INNER JOIN "user_course_ships" ON "users"."id" = "user_course_ships"."user_id" WHERE "user_course_ships"."course_id" = ? AND "user_course_ships"."status" = ?  [["course_id", 2], ["status", 2]]
---
    	<div class="col-sm-1 small">课程人数：</div>
    	<div class="col-sm-11"><label><%= @user_course_ship != nil && (@user_course_ship.status == UserCourseShip::StatusPassed || @current_user.level > User::LevelWatcher)?(link_to @course.users.size, course_user_list_path(@course)):(@course.users.size) %></label></div>